In [ ]:
import numpy as np
import pandas as pd

# 1Pandas and Numpy

### 1.2 Creating Dataframes

#### 1.2.1 With help of Numpy array

In [ ]:
data =  np.array([[1,4],[2,5],[3,6]])

In [ ]:
df = pd.DataFrame(data, index=['Row1', 'Row2', 'Row3'], columns=['Col1', 'Col2'])

In [30]:
df

  Student Name  Marks Obtained
0         Eres              20
1           Tu               2
2        Maria              15

#### 1.2.2 With help of list

In [ ]:
data = [[1,4], [2,5],[3,6]]

In [ ]:
df = pd.DataFrame(data, index=['A', 'B', 'C'], columns=['a', 'b'])

In [31]:
df

  Student Name  Marks Obtained
0         Eres              20
1           Tu               2
2        Maria              15

#### 1.2.3 With the help of Dictionary

In [ ]:
student_name = ['Eres', 'Tu', 'Maria']
marks_obtained = [20, 2, 15]

In [ ]:
# sorting list with Dict
test_results = {
    'Student Name': student_name,
    'Marks Obtained': marks_obtained
}

In [32]:
df = pd.DataFrame(test_results)
df

  Student Name  Marks Obtained
0         Eres              20
1           Tu               2
2        Maria              15

#### 1.2.4 By reading CSV file

In [33]:
df_exams = pd.read_csv('StudentsPerformance.csv')
df_exams.head()  # head() prints only first 5 rows of the data

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [34]:
#To print last 5 rows
df_exams.tail()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [35]:
# Getting access to the shape attribute
df_exams.shape

(1000, 8)

In [ ]:
# display number of rows
pd.set_option('display.max_rows', 1000)
df_exams